## advanced df
- apply()
- datetimes
- groupby()
- agg()

In [20]:
import pandas as pd

df = pd.read_csv("./data/french-ambs.csv")
df.head()

   id                name    place  year    lat   long      lat_long
0   0  Richer, Christophe  Denmark  1543  55.68  12.57  55.68, 12.57
1   1  Richer, Christophe  Denmark  1541  55.68  12.57  55.68, 12.57
2   2  Danzay, Charles de  Denmark  1561  55.68  12.57  55.68, 12.57
3   3  Danzay, Charles de  Denmark  1563  55.68  12.57  55.68, 12.57
4   4  Danzay, Charles de  Denmark  1582  55.68  12.57  55.68, 12.57

In [21]:
for col in df.columns:
    print(f"{col} is numeric?: {pd.api.types.is_numeric_dtype(df[col])}")

id is numeric?: True
name is numeric?: False
place is numeric?: False
year is numeric?: True
lat is numeric?: True
long is numeric?: True
lat_long is numeric?: False

In [22]:
from random import choice, seed
seed(41)#seeds a random generator so we all get the same random numbers

#df["year"] = f"{df["year"]}-{choice(range(1,13)):02d}-{choice(range(1,29)):02d}"
#this didnt work using apply

df["date_start"] = df["year"].apply(lambda x: f"{x}-{choice(range(1,13)):02d}-{choice(range(1,29)):02d}")
#lambda is an anonymous function, it takes in x and returns a string 
df.head()

,id,name,place,year,lat,long,lat_long,date_start
0,0,"Richer, Christophe",Denmark,1543,55.68,12.57,"55.68, 12.57",1543-07-11
1,1,"Richer, Christophe",Denmark,1541,55.68,12.57,"55.68, 12.57",1541-04-06
2,2,"Danzay, Charles de",Denmark,1561,55.68,12.57,"55.68, 12.57",1561-07-19
3,3,"Danzay, Charles de",Denmark,1563,55.68,12.57,"55.68, 12.57",1563-12-10
4,4,"Danzay, Charles de",Denmark,1582,55.68,12.57,"55.68, 12.57",1582-09-09

In [23]:
#drop the column date_start
df = df.drop(columns=["date_start"])

In [24]:
import numpy as np
#make year_start better by using named function


def get_year_start(row):
    rows = df.loc[
        (df["name"] == row["name"]) &
        (df["place"] == row["place"]) &
        (df["year"] == row["year"]-1)
    ]
    if len(rows) > 0:
        return np.nan
    date_string = f"{["year"]}-{choice(range(1,13)):02d}-{choice(range(1,29)):02d}"
    
df["date_start"] = df.apply(get_year_start, axis=1) #on a df, must pass axis
df.head()

,id,name,place,year,lat,long,lat_long,date_start
0,0,"Richer, Christophe",Denmark,1543,55.68,12.57,"55.68, 12.57",NaN
1,1,"Richer, Christophe",Denmark,1541,55.68,12.57,"55.68, 12.57",NaN
2,2,"Danzay, Charles de",Denmark,1561,55.68,12.57,"55.68, 12.57",NaN
3,3,"Danzay, Charles de",Denmark,1563,55.68,12.57,"55.68, 12.57",NaN
4,4,"Danzay, Charles de",Denmark,1582,55.68,12.57,"55.68, 12.57",NaN

In [25]:
def get_year_end(row):
    rows = df.loc[
        (df["name"] == row["name"]) &
        (df["place"] == row["place"]) &
        (df["year"] == row["year"]+1)
    ]
    if len(rows) > 0:
        return np.nan
    date_string = f"{["year"]}-{choice(range(1,13)):02d}-{choice(range(1,29)):02d}"
    
df["date_end"] = df.apply(get_year_end, axis=1) #on a df, must pass axis
df.head()

,id,name,place,year,lat,long,lat_long,date_start,date_end
0,0,"Richer, Christophe",Denmark,1543,55.68,12.57,"55.68, 12.57",NaN,NaN
1,1,"Richer, Christophe",Denmark,1541,55.68,12.57,"55.68, 12.57",NaN,NaN
2,2,"Danzay, Charles de",Denmark,1561,55.68,12.57,"55.68, 12.57",NaN,NaN
3,3,"Danzay, Charles de",Denmark,1563,55.68,12.57,"55.68, 12.57",NaN,NaN
4,4,"Danzay, Charles de",Denmark,1582,55.68,12.57,"55.68, 12.57",NaN,NaN

In [26]:
#bfill, ffill
df = df.sort_values(["place", "name", "year"], ascending=True).reset_index(drop=True)
df.head()

,id,name,place,year,lat,long,lat_long,date_start,date_end
0,422,"Danzay, Charles de",Denmark,1557,55.68,12.57,"55.68, 12.57",NaN,NaN
1,638,"Danzay, Charles de",Denmark,1558,55.68,12.57,"55.68, 12.57",NaN,NaN
2,704,"Danzay, Charles de",Denmark,1559,55.68,12.57,"55.68, 12.57",NaN,NaN
3,421,"Danzay, Charles de",Denmark,1560,55.68,12.57,"55.68, 12.57",NaN,NaN
4,2,"Danzay, Charles de",Denmark,1561,55.68,12.57,"55.68, 12.57",NaN,NaN

In [27]:
df["date_start"] = df["date_start"].ffill()
df["date_end"] = df["date_end"].bfill()
df.head()

,id,name,place,year,lat,long,lat_long,date_start,date_end
0,422,"Danzay, Charles de",Denmark,1557,55.68,12.57,"55.68, 12.57",NaN,NaN
1,638,"Danzay, Charles de",Denmark,1558,55.68,12.57,"55.68, 12.57",NaN,NaN
2,704,"Danzay, Charles de",Denmark,1559,55.68,12.57,"55.68, 12.57",NaN,NaN
3,421,"Danzay, Charles de",Denmark,1560,55.68,12.57,"55.68, 12.57",NaN,NaN
4,2,"Danzay, Charles de",Denmark,1561,55.68,12.57,"55.68, 12.57",NaN,NaN

In [31]:
import datetime
fmt = "%Y-%M-%d"

df["date_start"] = df["date_start"].apply(lambda x: datetime.datetime.strptime(x, fmt))
df["date_end"] = df["date_end"].apply(lambda x: datetime.datetime.strptime(x, fmt))

df.head()

TypeError: strptime() argument 1 must be str, not float

In [ ]:
df.groupby(["place"]).count()

df.groupby(["place"]).agg(
    {
        "place": "count",
        "year": "min"
    }
)

df.groupby(["place"]).agg(
    place=("place", "count"),
    max=("year", "max"),
    min=("year", "min"),
    numb_ambs=("name", "nunique"),
    ambs=("name", "unique")
). reset_index()
places_df["range"] = places_df["max"] - places_df["min"]